Microchip-MPLAB-Harmony/csp/apps/pio/pio_led_on_off_polling/firmware/src/packs/ATSAM9X60_DFP/component/pwm.h
/**
 * \brief Component description for PWM
 *
 * Copyright (c) 2019 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2019-02-20T18:44:00Z */
#ifndef _SAM9X_PWM_COMPONENT_H_
#define _SAM9X_PWM_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR PWM                                          */
/* ************************************************************************** */

/* -------- PWM_CMR : (PWM Offset: 0x00) (R/W 32) PWM Channel Mode Register -------- */
#define PWM_CMR_CPRE_Pos                      _U_(0)                                               /**< (PWM_CMR) Channel Prescaler Position */
#define PWM_CMR_CPRE_Msk                      (_U_(0xF) << PWM_CMR_CPRE_Pos)                       /**< (PWM_CMR) Channel Prescaler Mask */
#define PWM_CMR_CPRE(value)                   (PWM_CMR_CPRE_Msk & ((value) << PWM_CMR_CPRE_Pos))  
#define   PWM_CMR_CPRE_MCK_Val                _U_(0x0)                                             /**< (PWM_CMR) Master Clock  */
#define   PWM_CMR_CPRE_MCKDIV2_Val            _U_(0x1)                                             /**< (PWM_CMR) Master Clock divided by 2  */
#define   PWM_CMR_CPRE_MCKDIV4_Val            _U_(0x2)                                             /**< (PWM_CMR) Master Clock divided by 4  */
#define   PWM_CMR_CPRE_MCKDIV8_Val            _U_(0x3)                                             /**< (PWM_CMR) Master Clock divided by 8  */
#define   PWM_CMR_CPRE_MCKDIV16_Val           _U_(0x4)                                             /**< (PWM_CMR) Master Clock divided by 16  */
#define   PWM_CMR_CPRE_MCKDIV32_Val           _U_(0x5)                                             /**< (PWM_CMR) Master Clock divided by 32  */
#define   PWM_CMR_CPRE_MCKDIV64_Val           _U_(0x6)                                             /**< (PWM_CMR) Master Clock divided by 64  */
#define   PWM_CMR_CPRE_MCKDIV128_Val          _U_(0x7)                                             /**< (PWM_CMR) Master Clock divided by 128  */
#define   PWM_CMR_CPRE_MCKDIV256_Val          _U_(0x8)                                             /**< (PWM_CMR) Master Clock divided by 256  */
#define   PWM_CMR_CPRE_MCKDIV512_Val          _U_(0x9)                                             /**< (PWM_CMR) Master Clock divided by 512  */
#define   PWM_CMR_CPRE_MCKDIV1024_Val         _U_(0xA)                                             /**< (PWM_CMR) Master Clock divided by 1024  */
#define   PWM_CMR_CPRE_CLKA_Val               _U_(0xB)                                             /**< (PWM_CMR) Clock A  */
#define   PWM_CMR_CPRE_CLKB_Val               _U_(0xC)                                             /**< (PWM_CMR) Clock B  */
#define PWM_CMR_CPRE_MCK                      (PWM_CMR_CPRE_MCK_Val << PWM_CMR_CPRE_Pos)           /**< (PWM_CMR) Master Clock Position  */
#define PWM_CMR_CPRE_MCKDIV2                  (PWM_CMR_CPRE_MCKDIV2_Val << PWM_CMR_CPRE_Pos)       /**< (PWM_CMR) Master Clock divided by 2 Position  */
#define PWM_CMR_CPRE_MCKDIV4                  (PWM_CMR_CPRE_MCKDIV4_Val << PWM_CMR_CPRE_Pos)       /**< (PWM_CMR) Master Clock divided by 4 Position  */
#define PWM_CMR_CPRE_MCKDIV8                  (PWM_CMR_CPRE_MCKDIV8_Val << PWM_CMR_CPRE_Pos)       /**< (PWM_CMR) Master Clock divided by 8 Position  */
#define PWM_CMR_CPRE_MCKDIV16                 (PWM_CMR_CPRE_MCKDIV16_Val << PWM_CMR_CPRE_Pos)      /**< (PWM_CMR) Master Clock divided by 16 Position  */
#define PWM_CMR_CPRE_MCKDIV32                 (PWM_CMR_CPRE_MCKDIV32_Val << PWM_CMR_CPRE_Pos)      /**< (PWM_CMR) Master Clock divided by 32 Position  */
#define PWM_CMR_CPRE_MCKDIV64                 (PWM_CMR_CPRE_MCKDIV64_Val << PWM_CMR_CPRE_Pos)      /**< (PWM_CMR) Master Clock divided by 64 Position  */
#define PWM_CMR_CPRE_MCKDIV128                (PWM_CMR_CPRE_MCKDIV128_Val << PWM_CMR_CPRE_Pos)     /**< (PWM_CMR) Master Clock divided by 128 Position  */
#define PWM_CMR_CPRE_MCKDIV256                (PWM_CMR_CPRE_MCKDIV256_Val << PWM_CMR_CPRE_Pos)     /**< (PWM_CMR) Master Clock divided by 256 Position  */
#define PWM_CMR_CPRE_MCKDIV512                (PWM_CMR_CPRE_MCKDIV512_Val << PWM_CMR_CPRE_Pos)     /**< (PWM_CMR) Master Clock divided by 512 Position  */
#define PWM_CMR_CPRE_MCKDIV1024               (PWM_CMR_CPRE_MCKDIV1024_Val << PWM_CMR_CPRE_Pos)    /**< (PWM_CMR) Master Clock divided by 1024 Position  */
#define PWM_CMR_CPRE_CLKA                     (PWM_CMR_CPRE_CLKA_Val << PWM_CMR_CPRE_Pos)          /**< (PWM_CMR) Clock A Position  */
#define PWM_CMR_CPRE_CLKB                     (PWM_CMR_CPRE_CLKB_Val << PWM_CMR_CPRE_Pos)          /**< (PWM_CMR) Clock B Position  */
#define PWM_CMR_CALG_Pos                      _U_(8)                                               /**< (PWM_CMR) Channel Alignment Position */
#define PWM_CMR_CALG_Msk                      (_U_(0x1) << PWM_CMR_CALG_Pos)                       /**< (PWM_CMR) Channel Alignment Mask */
#define PWM_CMR_CALG(value)                   (PWM_CMR_CALG_Msk & ((value) << PWM_CMR_CALG_Pos))  
#define PWM_CMR_CPOL_Pos                      _U_(9)                                               /**< (PWM_CMR) Channel Polarity Position */
#define PWM_CMR_CPOL_Msk                      (_U_(0x1) << PWM_CMR_CPOL_Pos)                       /**< (PWM_CMR) Channel Polarity Mask */
#define PWM_CMR_CPOL(value)                   (PWM_CMR_CPOL_Msk & ((value) << PWM_CMR_CPOL_Pos))  
#define PWM_CMR_CPD_Pos                       _U_(10)                                              /**< (PWM_CMR) Channel Update Period Position */
#define PWM_CMR_CPD_Msk                       (_U_(0x1) << PWM_CMR_CPD_Pos)                        /**< (PWM_CMR) Channel Update Period Mask */
#define PWM_CMR_CPD(value)                    (PWM_CMR_CPD_Msk & ((value) << PWM_CMR_CPD_Pos))    
#define PWM_CMR_Msk                           _U_(0x0000070F)                                      /**< (PWM_CMR) Register Mask  */


