Microchip-MPLAB-Harmony/csp/apps/pio/pio_led_on_off_polling/firmware/src/packs/ATSAM9X60_DFP/component/pwm.h
/* -------- PWM_CDTY : (PWM Offset: 0x04) (R/W 32) PWM Channel Duty Cycle Register -------- */
#define PWM_CDTY_CDTY_Pos                     _U_(0)                                               /**< (PWM_CDTY) Channel Duty Cycle Position */
#define PWM_CDTY_CDTY_Msk                     (_U_(0xFFFFFFFF) << PWM_CDTY_CDTY_Pos)               /**< (PWM_CDTY) Channel Duty Cycle Mask */
#define PWM_CDTY_CDTY(value)                  (PWM_CDTY_CDTY_Msk & ((value) << PWM_CDTY_CDTY_Pos))
#define PWM_CDTY_Msk                          _U_(0xFFFFFFFF)                                      /**< (PWM_CDTY) Register Mask  */


/* -------- PWM_CPRD : (PWM Offset: 0x08) (R/W 32) PWM Channel Period Register -------- */
#define PWM_CPRD_CPRD_Pos                     _U_(0)                                               /**< (PWM_CPRD) Channel Period Position */
#define PWM_CPRD_CPRD_Msk                     (_U_(0xFFFFFFFF) << PWM_CPRD_CPRD_Pos)               /**< (PWM_CPRD) Channel Period Mask */
#define PWM_CPRD_CPRD(value)                  (PWM_CPRD_CPRD_Msk & ((value) << PWM_CPRD_CPRD_Pos))
#define PWM_CPRD_Msk                          _U_(0xFFFFFFFF)                                      /**< (PWM_CPRD) Register Mask  */


/* -------- PWM_CCNT : (PWM Offset: 0x0C) ( R/ 32) PWM Channel Counter Register -------- */
#define PWM_CCNT_CNT_Pos                      _U_(0)                                               /**< (PWM_CCNT) Channel Counter Register Position */
#define PWM_CCNT_CNT_Msk                      (_U_(0xFFFFFFFF) << PWM_CCNT_CNT_Pos)                /**< (PWM_CCNT) Channel Counter Register Mask */
#define PWM_CCNT_CNT(value)                   (PWM_CCNT_CNT_Msk & ((value) << PWM_CCNT_CNT_Pos))  
#define PWM_CCNT_Msk                          _U_(0xFFFFFFFF)                                      /**< (PWM_CCNT) Register Mask  */


/* -------- PWM_CUPD : (PWM Offset: 0x10) ( /W 32) PWM Channel Update Register -------- */
#define PWM_CUPD_CUPD_Pos                     _U_(0)                                               /**< (PWM_CUPD) Channel Update Register Position */
#define PWM_CUPD_CUPD_Msk                     (_U_(0xFFFFFFFF) << PWM_CUPD_CUPD_Pos)               /**< (PWM_CUPD) Channel Update Register Mask */
#define PWM_CUPD_CUPD(value)                  (PWM_CUPD_CUPD_Msk & ((value) << PWM_CUPD_CUPD_Pos))
#define PWM_CUPD_Msk                          _U_(0xFFFFFFFF)                                      /**< (PWM_CUPD) Register Mask  */


/* -------- PWM_MR : (PWM Offset: 0x00) (R/W 32) PWM Mode Register -------- */
#define PWM_MR_DIVA_Pos                       _U_(0)                                               /**< (PWM_MR) CLKA Divide Factor Position */
#define PWM_MR_DIVA_Msk                       (_U_(0xFF) << PWM_MR_DIVA_Pos)                       /**< (PWM_MR) CLKA Divide Factor Mask */
#define PWM_MR_DIVA(value)                    (PWM_MR_DIVA_Msk & ((value) << PWM_MR_DIVA_Pos))    
#define   PWM_MR_DIVA_CLK_OFF_Val             _U_(0x0)                                             /**< (PWM_MR) CLKA clock is turned off  */
#define   PWM_MR_DIVA_CLK_DIV1_Val            _U_(0x1)                                             /**< (PWM_MR) CLKA clock is clock selected by PREA  */
#define PWM_MR_DIVA_CLK_OFF                   (PWM_MR_DIVA_CLK_OFF_Val << PWM_MR_DIVA_Pos)         /**< (PWM_MR) CLKA clock is turned off Position  */
#define PWM_MR_DIVA_CLK_DIV1                  (PWM_MR_DIVA_CLK_DIV1_Val << PWM_MR_DIVA_Pos)        /**< (PWM_MR) CLKA clock is clock selected by PREA Position  */
#define PWM_MR_PREA_Pos                       _U_(8)                                               /**< (PWM_MR) CLKA Source Clock Selection Position */
#define PWM_MR_PREA_Msk                       (_U_(0xF) << PWM_MR_PREA_Pos)                        /**< (PWM_MR) CLKA Source Clock Selection Mask */
#define PWM_MR_PREA(value)                    (PWM_MR_PREA_Msk & ((value) << PWM_MR_PREA_Pos))    
#define   PWM_MR_PREA_MCK_Val                 _U_(0x0)                                             /**< (PWM_MR) Master Clock  */
#define   PWM_MR_PREA_MCKDIV2_Val             _U_(0x1)                                             /**< (PWM_MR) Master Clock divided by 2  */
#define   PWM_MR_PREA_MCKDIV4_Val             _U_(0x2)                                             /**< (PWM_MR) Master Clock divided by 4  */
#define   PWM_MR_PREA_MCKDIV8_Val             _U_(0x3)                                             /**< (PWM_MR) Master Clock divided by 8  */
#define   PWM_MR_PREA_MCKDIV16_Val            _U_(0x4)                                             /**< (PWM_MR) Master Clock divided by 16  */
#define   PWM_MR_PREA_MCKDIV32_Val            _U_(0x5)                                             /**< (PWM_MR) Master Clock divided by 32  */
#define   PWM_MR_PREA_MCKDIV64_Val            _U_(0x6)                                             /**< (PWM_MR) Master Clock divided by 64  */
#define   PWM_MR_PREA_MCKDIV128_Val           _U_(0x7)                                             /**< (PWM_MR) Master Clock divided by 128  */
#define   PWM_MR_PREA_MCKDIV256_Val           _U_(0x8)                                             /**< (PWM_MR) Master Clock divided by 256  */
#define   PWM_MR_PREA_MCKDIV512_Val           _U_(0x9)                                             /**< (PWM_MR) Master Clock divided by 512  */
#define   PWM_MR_PREA_MCKDIV1024_Val          _U_(0xA)                                             /**< (PWM_MR) Master Clock divided by 1024  */
#define PWM_MR_PREA_MCK                       (PWM_MR_PREA_MCK_Val << PWM_MR_PREA_Pos)             /**< (PWM_MR) Master Clock Position  */
#define PWM_MR_PREA_MCKDIV2                   (PWM_MR_PREA_MCKDIV2_Val << PWM_MR_PREA_Pos)         /**< (PWM_MR) Master Clock divided by 2 Position  */
#define PWM_MR_PREA_MCKDIV4                   (PWM_MR_PREA_MCKDIV4_Val << PWM_MR_PREA_Pos)         /**< (PWM_MR) Master Clock divided by 4 Position  */
#define PWM_MR_PREA_MCKDIV8                   (PWM_MR_PREA_MCKDIV8_Val << PWM_MR_PREA_Pos)         /**< (PWM_MR) Master Clock divided by 8 Position  */
#define PWM_MR_PREA_MCKDIV16                  (PWM_MR_PREA_MCKDIV16_Val << PWM_MR_PREA_Pos)        /**< (PWM_MR) Master Clock divided by 16 Position  */
#define PWM_MR_PREA_MCKDIV32                  (PWM_MR_PREA_MCKDIV32_Val << PWM_MR_PREA_Pos)        /**< (PWM_MR) Master Clock divided by 32 Position  */
#define PWM_MR_PREA_MCKDIV64                  (PWM_MR_PREA_MCKDIV64_Val << PWM_MR_PREA_Pos)        /**< (PWM_MR) Master Clock divided by 64 Position  */
#define PWM_MR_PREA_MCKDIV128                 (PWM_MR_PREA_MCKDIV128_Val << PWM_MR_PREA_Pos)       /**< (PWM_MR) Master Clock divided by 128 Position  */
#define PWM_MR_PREA_MCKDIV256                 (PWM_MR_PREA_MCKDIV256_Val << PWM_MR_PREA_Pos)       /**< (PWM_MR) Master Clock divided by 256 Position  */
#define PWM_MR_PREA_MCKDIV512                 (PWM_MR_PREA_MCKDIV512_Val << PWM_MR_PREA_Pos)       /**< (PWM_MR) Master Clock divided by 512 Position  */
#define PWM_MR_PREA_MCKDIV1024                (PWM_MR_PREA_MCKDIV1024_Val << PWM_MR_PREA_Pos)      /**< (PWM_MR) Master Clock divided by 1024 Position  */
#define PWM_MR_DIVB_Pos                       _U_(16)                                              /**< (PWM_MR) CLKB Divide Factor Position */
#define PWM_MR_DIVB_Msk                       (_U_(0xFF) << PWM_MR_DIVB_Pos)                       /**< (PWM_MR) CLKB Divide Factor Mask */
#define PWM_MR_DIVB(value)                    (PWM_MR_DIVB_Msk & ((value) << PWM_MR_DIVB_Pos))    
#define   PWM_MR_DIVB_CLK_OFF_Val             _U_(0x0)                                             /**< (PWM_MR) CLKB clock is turned off  */
#define   PWM_MR_DIVB_CLK_DIV1_Val            _U_(0x1)                                             /**< (PWM_MR) CLKB clock is clock selected by PREB  */
#define PWM_MR_DIVB_CLK_OFF                   (PWM_MR_DIVB_CLK_OFF_Val << PWM_MR_DIVB_Pos)         /**< (PWM_MR) CLKB clock is turned off Position  */
#define PWM_MR_DIVB_CLK_DIV1                  (PWM_MR_DIVB_CLK_DIV1_Val << PWM_MR_DIVB_Pos)        /**< (PWM_MR) CLKB clock is clock selected by PREB Position  */
#define PWM_MR_PREB_Pos                       _U_(24)                                              /**< (PWM_MR) CLKB Source Clock Selection Position */
#define PWM_MR_PREB_Msk                       (_U_(0xF) << PWM_MR_PREB_Pos)                        /**< (PWM_MR) CLKB Source Clock Selection Mask */
#define PWM_MR_PREB(value)                    (PWM_MR_PREB_Msk & ((value) << PWM_MR_PREB_Pos))    
#define   PWM_MR_PREB_MCK_Val                 _U_(0x0)                                             /**< (PWM_MR) Master Clock  */
#define   PWM_MR_PREB_MCKDIV2_Val             _U_(0x1)                                             /**< (PWM_MR) Master Clock divided by 2  */
#define   PWM_MR_PREB_MCKDIV4_Val             _U_(0x2)                                             /**< (PWM_MR) Master Clock divided by 4  */
#define   PWM_MR_PREB_MCKDIV8_Val             _U_(0x3)                                             /**< (PWM_MR) Master Clock divided by 8  */
#define   PWM_MR_PREB_MCKDIV16_Val            _U_(0x4)                                             /**< (PWM_MR) Master Clock divided by 16  */
#define   PWM_MR_PREB_MCKDIV32_Val            _U_(0x5)                                             /**< (PWM_MR) Master Clock divided by 32  */
#define   PWM_MR_PREB_MCKDIV64_Val            _U_(0x6)                                             /**< (PWM_MR) Master Clock divided by 64  */
#define   PWM_MR_PREB_MCKDIV128_Val           _U_(0x7)                                             /**< (PWM_MR) Master Clock divided by 128  */
#define   PWM_MR_PREB_MCKDIV256_Val           _U_(0x8)                                             /**< (PWM_MR) Master Clock divided by 256  */
#define   PWM_MR_PREB_MCKDIV512_Val           _U_(0x9)                                             /**< (PWM_MR) Master Clock divided by 512  */
#define   PWM_MR_PREB_MCKDIV1024_Val          _U_(0xA)                                             /**< (PWM_MR) Master Clock divided by 1024  */
#define PWM_MR_PREB_MCK                       (PWM_MR_PREB_MCK_Val << PWM_MR_PREB_Pos)             /**< (PWM_MR) Master Clock Position  */
#define PWM_MR_PREB_MCKDIV2                   (PWM_MR_PREB_MCKDIV2_Val << PWM_MR_PREB_Pos)         /**< (PWM_MR) Master Clock divided by 2 Position  */
#define PWM_MR_PREB_MCKDIV4                   (PWM_MR_PREB_MCKDIV4_Val << PWM_MR_PREB_Pos)         /**< (PWM_MR) Master Clock divided by 4 Position  */
#define PWM_MR_PREB_MCKDIV8                   (PWM_MR_PREB_MCKDIV8_Val << PWM_MR_PREB_Pos)         /**< (PWM_MR) Master Clock divided by 8 Position  */
#define PWM_MR_PREB_MCKDIV16                  (PWM_MR_PREB_MCKDIV16_Val << PWM_MR_PREB_Pos)        /**< (PWM_MR) Master Clock divided by 16 Position  */
#define PWM_MR_PREB_MCKDIV32                  (PWM_MR_PREB_MCKDIV32_Val << PWM_MR_PREB_Pos)        /**< (PWM_MR) Master Clock divided by 32 Position  */
#define PWM_MR_PREB_MCKDIV64                  (PWM_MR_PREB_MCKDIV64_Val << PWM_MR_PREB_Pos)        /**< (PWM_MR) Master Clock divided by 64 Position  */
#define PWM_MR_PREB_MCKDIV128                 (PWM_MR_PREB_MCKDIV128_Val << PWM_MR_PREB_Pos)       /**< (PWM_MR) Master Clock divided by 128 Position  */
#define PWM_MR_PREB_MCKDIV256                 (PWM_MR_PREB_MCKDIV256_Val << PWM_MR_PREB_Pos)       /**< (PWM_MR) Master Clock divided by 256 Position  */
#define PWM_MR_PREB_MCKDIV512                 (PWM_MR_PREB_MCKDIV512_Val << PWM_MR_PREB_Pos)       /**< (PWM_MR) Master Clock divided by 512 Position  */
#define PWM_MR_PREB_MCKDIV1024                (PWM_MR_PREB_MCKDIV1024_Val << PWM_MR_PREB_Pos)      /**< (PWM_MR) Master Clock divided by 1024 Position  */
#define PWM_MR_Msk                            _U_(0x0FFF0FFF)                                      /**< (PWM_MR) Register Mask  */


/* -------- PWM_ENA : (PWM Offset: 0x04) ( /W 32) PWM Enable Register -------- */
#define PWM_ENA_CHID0_Pos                     _U_(0)                                               /**< (PWM_ENA) Channel ID Position */
#define PWM_ENA_CHID0_Msk                     (_U_(0x1) << PWM_ENA_CHID0_Pos)                      /**< (PWM_ENA) Channel ID Mask */
#define PWM_ENA_CHID0(value)                  (PWM_ENA_CHID0_Msk & ((value) << PWM_ENA_CHID0_Pos))
#define PWM_ENA_CHID1_Pos                     _U_(1)                                               /**< (PWM_ENA) Channel ID Position */
#define PWM_ENA_CHID1_Msk                     (_U_(0x1) << PWM_ENA_CHID1_Pos)                      /**< (PWM_ENA) Channel ID Mask */
#define PWM_ENA_CHID1(value)                  (PWM_ENA_CHID1_Msk & ((value) << PWM_ENA_CHID1_Pos))
#define PWM_ENA_CHID2_Pos                     _U_(2)                                               /**< (PWM_ENA) Channel ID Position */
#define PWM_ENA_CHID2_Msk                     (_U_(0x1) << PWM_ENA_CHID2_Pos)                      /**< (PWM_ENA) Channel ID Mask */
#define PWM_ENA_CHID2(value)                  (PWM_ENA_CHID2_Msk & ((value) << PWM_ENA_CHID2_Pos))
#define PWM_ENA_CHID3_Pos                     _U_(3)                                               /**< (PWM_ENA) Channel ID Position */
#define PWM_ENA_CHID3_Msk                     (_U_(0x1) << PWM_ENA_CHID3_Pos)                      /**< (PWM_ENA) Channel ID Mask */
#define PWM_ENA_CHID3(value)                  (PWM_ENA_CHID3_Msk & ((value) << PWM_ENA_CHID3_Pos))
#define PWM_ENA_Msk                           _U_(0x0000000F)                                      /**< (PWM_ENA) Register Mask  */

#define PWM_ENA_CHID_Pos                      _U_(0)                                               /**< (PWM_ENA Position) Channel ID */
#define PWM_ENA_CHID_Msk                      (_U_(0xF) << PWM_ENA_CHID_Pos)                       /**< (PWM_ENA Mask) CHID */
#define PWM_ENA_CHID(value)                   (PWM_ENA_CHID_Msk & ((value) << PWM_ENA_CHID_Pos))   

/* -------- PWM_DIS : (PWM Offset: 0x08) ( /W 32) PWM Disable Register -------- */
#define PWM_DIS_CHID0_Pos                     _U_(0)                                               /**< (PWM_DIS) Channel ID Position */
#define PWM_DIS_CHID0_Msk                     (_U_(0x1) << PWM_DIS_CHID0_Pos)                      /**< (PWM_DIS) Channel ID Mask */
#define PWM_DIS_CHID0(value)                  (PWM_DIS_CHID0_Msk & ((value) << PWM_DIS_CHID0_Pos))
#define PWM_DIS_CHID1_Pos                     _U_(1)                                               /**< (PWM_DIS) Channel ID Position */
#define PWM_DIS_CHID1_Msk                     (_U_(0x1) << PWM_DIS_CHID1_Pos)                      /**< (PWM_DIS) Channel ID Mask */
#define PWM_DIS_CHID1(value)                  (PWM_DIS_CHID1_Msk & ((value) << PWM_DIS_CHID1_Pos))
#define PWM_DIS_CHID2_Pos                     _U_(2)                                               /**< (PWM_DIS) Channel ID Position */
#define PWM_DIS_CHID2_Msk                     (_U_(0x1) << PWM_DIS_CHID2_Pos)                      /**< (PWM_DIS) Channel ID Mask */
#define PWM_DIS_CHID2(value)                  (PWM_DIS_CHID2_Msk & ((value) << PWM_DIS_CHID2_Pos))
#define PWM_DIS_CHID3_Pos                     _U_(3)                                               /**< (PWM_DIS) Channel ID Position */
#define PWM_DIS_CHID3_Msk                     (_U_(0x1) << PWM_DIS_CHID3_Pos)                      /**< (PWM_DIS) Channel ID Mask */
#define PWM_DIS_CHID3(value)                  (PWM_DIS_CHID3_Msk & ((value) << PWM_DIS_CHID3_Pos))
#define PWM_DIS_Msk                           _U_(0x0000000F)                                      /**< (PWM_DIS) Register Mask  */

