Microchip-MPLAB-Harmony/csp/apps/pio/pio_led_on_off_polling/firmware/src/packs/ATSAM9X60_DFP/component/pwm.h
#define PWM_DIS_CHID_Pos                      _U_(0)                                               /**< (PWM_DIS Position) Channel ID */
#define PWM_DIS_CHID_Msk                      (_U_(0xF) << PWM_DIS_CHID_Pos)                       /**< (PWM_DIS Mask) CHID */
#define PWM_DIS_CHID(value)                   (PWM_DIS_CHID_Msk & ((value) << PWM_DIS_CHID_Pos))   

/* -------- PWM_SR : (PWM Offset: 0x0C) ( R/ 32) PWM Status Register -------- */
#define PWM_SR_CHID0_Pos                      _U_(0)                                               /**< (PWM_SR) Channel ID Position */
#define PWM_SR_CHID0_Msk                      (_U_(0x1) << PWM_SR_CHID0_Pos)                       /**< (PWM_SR) Channel ID Mask */
#define PWM_SR_CHID0(value)                   (PWM_SR_CHID0_Msk & ((value) << PWM_SR_CHID0_Pos))  
#define PWM_SR_CHID1_Pos                      _U_(1)                                               /**< (PWM_SR) Channel ID Position */
#define PWM_SR_CHID1_Msk                      (_U_(0x1) << PWM_SR_CHID1_Pos)                       /**< (PWM_SR) Channel ID Mask */
#define PWM_SR_CHID1(value)                   (PWM_SR_CHID1_Msk & ((value) << PWM_SR_CHID1_Pos))  
#define PWM_SR_CHID2_Pos                      _U_(2)                                               /**< (PWM_SR) Channel ID Position */
#define PWM_SR_CHID2_Msk                      (_U_(0x1) << PWM_SR_CHID2_Pos)                       /**< (PWM_SR) Channel ID Mask */
#define PWM_SR_CHID2(value)                   (PWM_SR_CHID2_Msk & ((value) << PWM_SR_CHID2_Pos))  
#define PWM_SR_CHID3_Pos                      _U_(3)                                               /**< (PWM_SR) Channel ID Position */
#define PWM_SR_CHID3_Msk                      (_U_(0x1) << PWM_SR_CHID3_Pos)                       /**< (PWM_SR) Channel ID Mask */
#define PWM_SR_CHID3(value)                   (PWM_SR_CHID3_Msk & ((value) << PWM_SR_CHID3_Pos))  
#define PWM_SR_Msk                            _U_(0x0000000F)                                      /**< (PWM_SR) Register Mask  */

#define PWM_SR_CHID_Pos                       _U_(0)                                               /**< (PWM_SR Position) Channel ID */
#define PWM_SR_CHID_Msk                       (_U_(0xF) << PWM_SR_CHID_Pos)                        /**< (PWM_SR Mask) CHID */
#define PWM_SR_CHID(value)                    (PWM_SR_CHID_Msk & ((value) << PWM_SR_CHID_Pos))     

/* -------- PWM_IER : (PWM Offset: 0x10) ( /W 32) PWM Interrupt Enable Register -------- */
#define PWM_IER_CHID0_Pos                     _U_(0)                                               /**< (PWM_IER) Channel ID Position */
#define PWM_IER_CHID0_Msk                     (_U_(0x1) << PWM_IER_CHID0_Pos)                      /**< (PWM_IER) Channel ID Mask */
#define PWM_IER_CHID0(value)                  (PWM_IER_CHID0_Msk & ((value) << PWM_IER_CHID0_Pos))
#define PWM_IER_CHID1_Pos                     _U_(1)                                               /**< (PWM_IER) Channel ID Position */
#define PWM_IER_CHID1_Msk                     (_U_(0x1) << PWM_IER_CHID1_Pos)                      /**< (PWM_IER) Channel ID Mask */
#define PWM_IER_CHID1(value)                  (PWM_IER_CHID1_Msk & ((value) << PWM_IER_CHID1_Pos))
#define PWM_IER_CHID2_Pos                     _U_(2)                                               /**< (PWM_IER) Channel ID Position */
#define PWM_IER_CHID2_Msk                     (_U_(0x1) << PWM_IER_CHID2_Pos)                      /**< (PWM_IER) Channel ID Mask */
#define PWM_IER_CHID2(value)                  (PWM_IER_CHID2_Msk & ((value) << PWM_IER_CHID2_Pos))
#define PWM_IER_CHID3_Pos                     _U_(3)                                               /**< (PWM_IER) Channel ID Position */
#define PWM_IER_CHID3_Msk                     (_U_(0x1) << PWM_IER_CHID3_Pos)                      /**< (PWM_IER) Channel ID Mask */
#define PWM_IER_CHID3(value)                  (PWM_IER_CHID3_Msk & ((value) << PWM_IER_CHID3_Pos))
#define PWM_IER_Msk                           _U_(0x0000000F)                                      /**< (PWM_IER) Register Mask  */

#define PWM_IER_CHID_Pos                      _U_(0)                                               /**< (PWM_IER Position) Channel ID */
#define PWM_IER_CHID_Msk                      (_U_(0xF) << PWM_IER_CHID_Pos)                       /**< (PWM_IER Mask) CHID */
#define PWM_IER_CHID(value)                   (PWM_IER_CHID_Msk & ((value) << PWM_IER_CHID_Pos))   

/* -------- PWM_IDR : (PWM Offset: 0x14) ( /W 32) PWM Interrupt Disable Register -------- */
#define PWM_IDR_CHID0_Pos                     _U_(0)                                               /**< (PWM_IDR) Channel ID Position */
#define PWM_IDR_CHID0_Msk                     (_U_(0x1) << PWM_IDR_CHID0_Pos)                      /**< (PWM_IDR) Channel ID Mask */
#define PWM_IDR_CHID0(value)                  (PWM_IDR_CHID0_Msk & ((value) << PWM_IDR_CHID0_Pos))
#define PWM_IDR_CHID1_Pos                     _U_(1)                                               /**< (PWM_IDR) Channel ID Position */
#define PWM_IDR_CHID1_Msk                     (_U_(0x1) << PWM_IDR_CHID1_Pos)                      /**< (PWM_IDR) Channel ID Mask */
#define PWM_IDR_CHID1(value)                  (PWM_IDR_CHID1_Msk & ((value) << PWM_IDR_CHID1_Pos))
#define PWM_IDR_CHID2_Pos                     _U_(2)                                               /**< (PWM_IDR) Channel ID Position */
#define PWM_IDR_CHID2_Msk                     (_U_(0x1) << PWM_IDR_CHID2_Pos)                      /**< (PWM_IDR) Channel ID Mask */
#define PWM_IDR_CHID2(value)                  (PWM_IDR_CHID2_Msk & ((value) << PWM_IDR_CHID2_Pos))
#define PWM_IDR_CHID3_Pos                     _U_(3)                                               /**< (PWM_IDR) Channel ID Position */
#define PWM_IDR_CHID3_Msk                     (_U_(0x1) << PWM_IDR_CHID3_Pos)                      /**< (PWM_IDR) Channel ID Mask */
#define PWM_IDR_CHID3(value)                  (PWM_IDR_CHID3_Msk & ((value) << PWM_IDR_CHID3_Pos))
#define PWM_IDR_Msk                           _U_(0x0000000F)                                      /**< (PWM_IDR) Register Mask  */

#define PWM_IDR_CHID_Pos                      _U_(0)                                               /**< (PWM_IDR Position) Channel ID */
#define PWM_IDR_CHID_Msk                      (_U_(0xF) << PWM_IDR_CHID_Pos)                       /**< (PWM_IDR Mask) CHID */
#define PWM_IDR_CHID(value)                   (PWM_IDR_CHID_Msk & ((value) << PWM_IDR_CHID_Pos))   

/* -------- PWM_IMR : (PWM Offset: 0x18) ( R/ 32) PWM Interrupt Mask Register -------- */
#define PWM_IMR_CHID0_Pos                     _U_(0)                                               /**< (PWM_IMR) Channel ID Position */
#define PWM_IMR_CHID0_Msk                     (_U_(0x1) << PWM_IMR_CHID0_Pos)                      /**< (PWM_IMR) Channel ID Mask */
#define PWM_IMR_CHID0(value)                  (PWM_IMR_CHID0_Msk & ((value) << PWM_IMR_CHID0_Pos))
#define PWM_IMR_CHID1_Pos                     _U_(1)                                               /**< (PWM_IMR) Channel ID Position */
#define PWM_IMR_CHID1_Msk                     (_U_(0x1) << PWM_IMR_CHID1_Pos)                      /**< (PWM_IMR) Channel ID Mask */
#define PWM_IMR_CHID1(value)                  (PWM_IMR_CHID1_Msk & ((value) << PWM_IMR_CHID1_Pos))
#define PWM_IMR_CHID2_Pos                     _U_(2)                                               /**< (PWM_IMR) Channel ID Position */
#define PWM_IMR_CHID2_Msk                     (_U_(0x1) << PWM_IMR_CHID2_Pos)                      /**< (PWM_IMR) Channel ID Mask */
#define PWM_IMR_CHID2(value)                  (PWM_IMR_CHID2_Msk & ((value) << PWM_IMR_CHID2_Pos))
#define PWM_IMR_CHID3_Pos                     _U_(3)                                               /**< (PWM_IMR) Channel ID Position */
#define PWM_IMR_CHID3_Msk                     (_U_(0x1) << PWM_IMR_CHID3_Pos)                      /**< (PWM_IMR) Channel ID Mask */
#define PWM_IMR_CHID3(value)                  (PWM_IMR_CHID3_Msk & ((value) << PWM_IMR_CHID3_Pos))
#define PWM_IMR_Msk                           _U_(0x0000000F)                                      /**< (PWM_IMR) Register Mask  */

#define PWM_IMR_CHID_Pos                      _U_(0)                                               /**< (PWM_IMR Position) Channel ID */
#define PWM_IMR_CHID_Msk                      (_U_(0xF) << PWM_IMR_CHID_Pos)                       /**< (PWM_IMR Mask) CHID */
#define PWM_IMR_CHID(value)                   (PWM_IMR_CHID_Msk & ((value) << PWM_IMR_CHID_Pos))   

/* -------- PWM_ISR : (PWM Offset: 0x1C) ( R/ 32) PWM Interrupt Status Register -------- */
#define PWM_ISR_CHID0_Pos                     _U_(0)                                               /**< (PWM_ISR) Channel ID Position */
#define PWM_ISR_CHID0_Msk                     (_U_(0x1) << PWM_ISR_CHID0_Pos)                      /**< (PWM_ISR) Channel ID Mask */
#define PWM_ISR_CHID0(value)                  (PWM_ISR_CHID0_Msk & ((value) << PWM_ISR_CHID0_Pos))
#define PWM_ISR_CHID1_Pos                     _U_(1)                                               /**< (PWM_ISR) Channel ID Position */
#define PWM_ISR_CHID1_Msk                     (_U_(0x1) << PWM_ISR_CHID1_Pos)                      /**< (PWM_ISR) Channel ID Mask */
#define PWM_ISR_CHID1(value)                  (PWM_ISR_CHID1_Msk & ((value) << PWM_ISR_CHID1_Pos))
#define PWM_ISR_CHID2_Pos                     _U_(2)                                               /**< (PWM_ISR) Channel ID Position */
#define PWM_ISR_CHID2_Msk                     (_U_(0x1) << PWM_ISR_CHID2_Pos)                      /**< (PWM_ISR) Channel ID Mask */
#define PWM_ISR_CHID2(value)                  (PWM_ISR_CHID2_Msk & ((value) << PWM_ISR_CHID2_Pos))
#define PWM_ISR_CHID3_Pos                     _U_(3)                                               /**< (PWM_ISR) Channel ID Position */
#define PWM_ISR_CHID3_Msk                     (_U_(0x1) << PWM_ISR_CHID3_Pos)                      /**< (PWM_ISR) Channel ID Mask */
#define PWM_ISR_CHID3(value)                  (PWM_ISR_CHID3_Msk & ((value) << PWM_ISR_CHID3_Pos))
#define PWM_ISR_Msk                           _U_(0x0000000F)                                      /**< (PWM_ISR) Register Mask  */

