Microchip-MPLAB-Harmony/csp/apps/pio/pio_led_on_off_polling/firmware/src/packs/ATSAM9X60_DFP/component/pwm.h
#define PWM_ISR_CHID_Pos                      _U_(0)                                               /**< (PWM_ISR Position) Channel ID */
#define PWM_ISR_CHID_Msk                      (_U_(0xF) << PWM_ISR_CHID_Pos)                       /**< (PWM_ISR Mask) CHID */
#define PWM_ISR_CHID(value)                   (PWM_ISR_CHID_Msk & ((value) << PWM_ISR_CHID_Pos))   

/* -------- PWM_VERSION : (PWM Offset: 0xFC) ( R/ 32) Version Register -------- */
#define PWM_VERSION_VERSION_Pos               _U_(0)                                               /**< (PWM_VERSION) Version of the Hardware Module Position */
#define PWM_VERSION_VERSION_Msk               (_U_(0xFFF) << PWM_VERSION_VERSION_Pos)              /**< (PWM_VERSION) Version of the Hardware Module Mask */
#define PWM_VERSION_VERSION(value)            (PWM_VERSION_VERSION_Msk & ((value) << PWM_VERSION_VERSION_Pos))
#define PWM_VERSION_MFN_Pos                   _U_(16)                                              /**< (PWM_VERSION) Metal Fix Number Position */
#define PWM_VERSION_MFN_Msk                   (_U_(0x7) << PWM_VERSION_MFN_Pos)                    /**< (PWM_VERSION) Metal Fix Number Mask */
#define PWM_VERSION_MFN(value)                (PWM_VERSION_MFN_Msk & ((value) << PWM_VERSION_MFN_Pos))
#define PWM_VERSION_Msk                       _U_(0x00070FFF)                                      /**< (PWM_VERSION) Register Mask  */


/** \brief PWM register offsets definitions */
#define PWM_CMR_REG_OFST               (0x00)              /**< (PWM_CMR) PWM Channel Mode Register Offset */
#define PWM_CDTY_REG_OFST              (0x04)              /**< (PWM_CDTY) PWM Channel Duty Cycle Register Offset */
#define PWM_CPRD_REG_OFST              (0x08)              /**< (PWM_CPRD) PWM Channel Period Register Offset */
#define PWM_CCNT_REG_OFST              (0x0C)              /**< (PWM_CCNT) PWM Channel Counter Register Offset */
#define PWM_CUPD_REG_OFST              (0x10)              /**< (PWM_CUPD) PWM Channel Update Register Offset */
#define PWM_MR_REG_OFST                (0x00)              /**< (PWM_MR) PWM Mode Register Offset */
#define PWM_ENA_REG_OFST               (0x04)              /**< (PWM_ENA) PWM Enable Register Offset */
#define PWM_DIS_REG_OFST               (0x08)              /**< (PWM_DIS) PWM Disable Register Offset */
#define PWM_SR_REG_OFST                (0x0C)              /**< (PWM_SR) PWM Status Register Offset */
#define PWM_IER_REG_OFST               (0x10)              /**< (PWM_IER) PWM Interrupt Enable Register Offset */
#define PWM_IDR_REG_OFST               (0x14)              /**< (PWM_IDR) PWM Interrupt Disable Register Offset */
#define PWM_IMR_REG_OFST               (0x18)              /**< (PWM_IMR) PWM Interrupt Mask Register Offset */
#define PWM_ISR_REG_OFST               (0x1C)              /**< (PWM_ISR) PWM Interrupt Status Register Offset */
#define PWM_VERSION_REG_OFST           (0xFC)              /**< (PWM_VERSION) Version Register Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief PWM_CH_NUM register API structure */
typedef struct
{
  __IO  uint32_t                       PWM_CMR;            /**< Offset: 0x00 (R/W  32) PWM Channel Mode Register */
  __IO  uint32_t                       PWM_CDTY;           /**< Offset: 0x04 (R/W  32) PWM Channel Duty Cycle Register */
  __IO  uint32_t                       PWM_CPRD;           /**< Offset: 0x08 (R/W  32) PWM Channel Period Register */
  __I   uint32_t                       PWM_CCNT;           /**< Offset: 0x0C (R/   32) PWM Channel Counter Register */
  __O   uint32_t                       PWM_CUPD;           /**< Offset: 0x10 ( /W  32) PWM Channel Update Register */
  __I   uint8_t                        Reserved1[0x0C];
} pwm_ch_num_registers_t;

#define PWM_CH_NUM_NUMBER _U_(4)

/** \brief PWM register API structure */
typedef struct
{
  __IO  uint32_t                       PWM_MR;             /**< Offset: 0x00 (R/W  32) PWM Mode Register */
  __O   uint32_t                       PWM_ENA;            /**< Offset: 0x04 ( /W  32) PWM Enable Register */
  __O   uint32_t                       PWM_DIS;            /**< Offset: 0x08 ( /W  32) PWM Disable Register */
  __I   uint32_t                       PWM_SR;             /**< Offset: 0x0C (R/   32) PWM Status Register */
  __O   uint32_t                       PWM_IER;            /**< Offset: 0x10 ( /W  32) PWM Interrupt Enable Register */
  __O   uint32_t                       PWM_IDR;            /**< Offset: 0x14 ( /W  32) PWM Interrupt Disable Register */
  __I   uint32_t                       PWM_IMR;            /**< Offset: 0x18 (R/   32) PWM Interrupt Mask Register */
  __I   uint32_t                       PWM_ISR;            /**< Offset: 0x1C (R/   32) PWM Interrupt Status Register */
  __I   uint8_t                        Reserved1[0xDC];
  __I   uint32_t                       PWM_VERSION;        /**< Offset: 0xFC (R/   32) Version Register */
  __I   uint8_t                        Reserved2[0x100];
        pwm_ch_num_registers_t         PWM_CH_NUM[PWM_CH_NUM_NUMBER]; /**< Offset: 0x200  */
} pwm_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAM9X_PWM_COMPONENT_H_ */
